###################################################################

# Created by write_sdc on Sun May  5 11:06:38 2019

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports power]
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports {code[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {code[0]}]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_input_delay -clock clk  0.1  [get_ports power]
set_input_delay -clock clk  0.1  [get_ports {code[15]}]
set_input_delay -clock clk  0.1  [get_ports {code[14]}]
set_input_delay -clock clk  0.1  [get_ports {code[13]}]
set_input_delay -clock clk  0.1  [get_ports {code[12]}]
set_input_delay -clock clk  0.1  [get_ports {code[11]}]
set_input_delay -clock clk  0.1  [get_ports {code[10]}]
set_input_delay -clock clk  0.1  [get_ports {code[9]}]
set_input_delay -clock clk  0.1  [get_ports {code[8]}]
set_input_delay -clock clk  0.1  [get_ports {code[7]}]
set_input_delay -clock clk  0.1  [get_ports {code[6]}]
set_input_delay -clock clk  0.1  [get_ports {code[5]}]
set_input_delay -clock clk  0.1  [get_ports {code[4]}]
set_input_delay -clock clk  0.1  [get_ports {code[3]}]
set_input_delay -clock clk  0.1  [get_ports {code[2]}]
set_input_delay -clock clk  0.1  [get_ports {code[1]}]
set_input_delay -clock clk  0.1  [get_ports {code[0]}]
set_output_delay -clock clk  0.1  [get_ports {pc[7]}]
set_output_delay -clock clk  0.1  [get_ports {pc[6]}]
set_output_delay -clock clk  0.1  [get_ports {pc[5]}]
set_output_delay -clock clk  0.1  [get_ports {pc[4]}]
set_output_delay -clock clk  0.1  [get_ports {pc[3]}]
set_output_delay -clock clk  0.1  [get_ports {pc[2]}]
set_output_delay -clock clk  0.1  [get_ports {pc[1]}]
set_output_delay -clock clk  0.1  [get_ports {pc[0]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[31]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[30]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[29]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[28]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[27]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[26]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[25]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[24]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[23]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[22]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[21]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[20]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[19]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[18]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[17]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[16]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[15]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[14]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[13]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[12]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[11]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[10]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[9]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[8]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[7]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[6]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[5]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[4]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[3]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[2]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[1]}]
set_output_delay -clock clk  0.1  [get_ports {mem_s[0]}]
set_output_delay -clock clk  0.1  [get_ports write_en]
set_output_delay -clock clk  0.1  [get_ports imm_en]
set_output_delay -clock clk  0.1  [get_ports branch_en]
set_output_delay -clock clk  0.1  [get_ports {next_pc[7]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[6]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[5]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[4]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[3]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[2]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[1]}]
set_output_delay -clock clk  0.1  [get_ports {next_pc[0]}]
